// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

/* Console.WriteLine("Введите числа в строку через пробел:");
string userInput = Console.ReadLine();
string[] array = userInput.Split(' ');
int result = 0;

foreach (var item in array)
{
    int number = Convert.ToInt32(item);

    if (number > 0)
    {
        result++;
    }
}
Console.WriteLine($"Пользователь ввел {result} положительных чисел отличных от нуля"); */