// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//Пример: 
// 456 -> 5
// 782 -> 8 
// 918 -> 1

// Console.Write("Введите трехзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int firstNumber = number / 10;
// int secondDigit = firstNumber % 10;

// Console.WriteLine("Вторая цифра: " + secondDigit);
