// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//Пример: 
// 456 -> 5
// 782 -> 8 
// 918 -> 1

// Console.Write("Введите трехзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int firstNumber = number / 10;
// int secondDigit = firstNumber % 10;

// Console.WriteLine("Вторая цифра: " + secondDigit);

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//Пример: 
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6
